zsurge/SecureHead/GD32APP0320/Src/app.c
#include <stdlib.h>
#include <stdio.h>
#include "app.h"
#include "gd32f1x0_wwdgt.h"
#include "usb_endp.h"
#include "ini.h"
#include "systick.h"
#include "dev_uart.h"


union __ENC_KEY ENC_KEY;					//密钥保存数据结构
uint8_t CryptoKey[16];						//DUKPT计算出的过程密钥
								  	
uint8_t random[8];							//随机数
uint8_t macdata[8];							//鉴别数据

const char SHID[] = "PF SecureHeadReader V 1.02";
#ifdef FLASHKEY_SUPPORT
const char APPVERSION[] = "VPFASTMG180324003";
#else
const char APPVERSION[] = "VPFASTMS180324003";
#endif

volatile uint8_t WriteFlag = 0;				//保存密钥标志：0：不保存，1：使能保存
volatile uint8_t GetNextFlag = 0;			//获取下一个KSN标志：0：不获取下一个，1：使能获取下一个 

volatile uint8_t macstate = 0x00;			//鉴定状态：0x30：未接收到鉴定数据或鉴定数据失败；0x31：鉴定数据OK
volatile uint8_t encryptdatastatus = 0x00;	//bit 1 ==1 表示1磁道加密数据存在
											//bit 2 ==1 表示2磁道加密数据存在
											//bit 3 ==1 表示3磁道加密数据存在
											//bit 4 ==1 表示1磁道哈希数据存在
											//bit 5 ==1 表示2磁道哈希数据存在
											//bit 6 ==1 表示3磁道哈希数据存在
											//bit 7 ==1 表示会话ID数据存在
											//bit 8 ==1 表示KSN存在

volatile uint8_t RxdStatus = 0;			 		//接收状态
volatile uint8_t SynHead = 0;				 	//接收包头个数
volatile uint8_t RxdFrameStatus = 0;			//接收包状态
volatile uint8_t NowLen = 0;				 	//接收字节指针
volatile uint8_t RxdTotalLen = 0;			 	//接收包数据长度
// uint8_t RxdBuf[MAX_RXD_BUF_LEN];			//接收包数据缓存
// uint8_t SetKeyBuf[80];			    		//设置密钥数据缓存
#define RxdBuf ((uint8_t *)TempTrackDirtData.Value)			//接收包数据缓存
#define SetKeyBuf ((uint8_t *)TempTrackData.Value)			    		//设置密钥数据缓存
volatile uint8_t SetKeyLen=0;			    //设置密钥数据长度
volatile uint8_t SetKeyFlag=0;				//设置密钥标志，0：不能设置；1：允许设置。
volatile uint8_t Bcc;						//校验和

//关闭所有中断
void NVIC_Clear_all(void)
{
	uint32_t i;
	for(i=0; i<3; i++)
		NVIC->ICER[i] = 0;
	for(i=0; i<3; i++)
		NVIC->ICPR[i] = 0;
}

#if 0
/**************************************************************************//**
 * @brief This function sets up the Cortex M-3 with a new SP and PC.
 *****************************************************************************/
#if defined ( __CC_ARM   )
__asm void BOOT_jump(uint32_t sp, uint32_t pc)
{
  /* Set new MSP, PSP based on SP (r0)*/
  msr msp, r0
  msr psp, r0

  /* Jump to PC (r1)*/
  //mov pc, r1
  BX r1;
}
#else
void BOOT_jump(uint32_t sp, uint32_t pc)
{
  (void) sp;
  (void) pc;
  /* Set new MSP, PSP based on SP (r0)*/
  __asm("msr msp, r0");
  __asm("msr psp, r0");

  /* Jump to PC (r1)*/
  __asm("mov pc, r1");
}
#endif

/**************************************************************************//**
 * @brief Boots the application
 *****************************************************************************/
void BOOT_boot(void)
{
	/* Clear all interrupts set. */
	NVIC->ICER[0] = 0xFFFFFFFF;
	NVIC->ICER[1] = 0xFFFFFFFF;

	/* Set new vector table */
	SCB->VTOR = (uint32_t) BOOT_ADDR;

	SCB->AIRCR = 0x05FA0004;

	/* Read new SP and PC from vector table */
	BOOT_jump(*((uint32_t *) BOOT_ADDR),*((uint32_t *) BOOT_ADDR + 1));
}

#endif


void init_serial_boot(void)
{
	RxdStatus = 0;
	SynHead = 0;
	RxdFrameStatus = SPACE;
}

void ResetSetting(void)
{
	SetKeyFlag = 0;
	memset(ENC_KEY.key,0x00,140);
	ENC_KEY.temp.level = 0x31;//加密等级为0x31
	ENC_KEY.temp.enabledevice = 0x31; //启用、禁止标志位
	ENC_KEY.temp.writesnflag = 0x30;  //写sn标志位
	ENC_KEY.temp.selecttrack = 0x30;    //选择磁道参数
	ENC_KEY.temp.Terminator = 0x0D;     //磁道结束符
	ENC_KEY.temp.setseparator = 0x00;   //写入分割符	
	ENC_KEY.temp.beepmode = 0x32;
	ENC_KEY.temp.settrack2format = 0x31;
	ENC_KEY.temp.status = 0;			//失能加密
	ENC_KEY.temp.encway = 0x00;			//默认DES加密
	macstate = 0x00;					//未接收到鉴定数据
	
	WriteFlag = 1;
	WriteENCKEY();	
	WriteFlag = 0;						
}

/**************************************************************************************
	*** 函 数 名:	void WriteENCKEY(void)
	*** 功能描述：	讲ENCKEY保存到FLASH中
	*** 参    数:  	输入: 全局变量ENC_KEY
					输入: ENC_KEY保存地址
				    输出：NULL 
	*** 返 回 值:	NULL  	 	
	*** 模块信息: 	Ouyangweiquan 2011.09.20创建
***************************************************************************************/
void WriteENCKEY(void)
{
	#ifdef FLASHKEY_SUPPORT
	uint8_t i;
	uint8_t tempdata[140];
	memset(tempdata ,0, sizeof(tempdata));
	if(WriteFlag==1)
	{
		memcpy(tempdata,ENC_KEY.key,138);
		memcpy(tempdata+138,"\x00\x00",2);
		for(i=0;i<138;i++)
		{
			tempdata[138] ^= tempdata[i];
			tempdata[139] += tempdata[i];
		}
 		for(i=0;i<8;i++)
 			tri_des(tempdata+i*8,(unsigned char *)SHID,(unsigned char *)SHID+8,0);	   //加密要存储的密钥值
		__disable_irq();
		EarseBlockFlash(KEYADD);
		WriteBlockFlash(KEYADD ,tempdata, 140);
		__enable_irq();
		return ;
	}
	else
	{
		return ;
	}
	#endif
	
}

/**************************************************************************************
	*** 函 数 名:	void ReadENCKEY(void)
	*** 功能描述：	读取保存的ENCKEY到RAM中
	*** 参    数:  	输入: ENC_KEY保存地址
				    输出：全局变量ENC_KEY 
	*** 返 回 值:	TRUE/FALSE   	 	
	*** 模块信息: 	Ouyangweiquan 2011.09.20创建
***************************************************************************************/
uint8_t ReadENCKEY(void)
{
	#ifdef FLASHKEY_SUPPORT
	uint8_t tempdata[140],i,lrc,bcc;
	memset(tempdata ,0, 140);
	ReadBlockFlash(KEYADD ,tempdata, 140);     			//读出之前保存的密钥值
	for(i=0;i<8;i++)
		tri_des(tempdata+i*8,(unsigned char *)SHID,(unsigned char *)SHID+8,1);	   //解密存储的密钥值
	memcpy(ENC_KEY.key,tempdata,140);
	//校验保存的密钥
	for(lrc=bcc=i=0;i<138;i++)
	{
		lrc ^= tempdata[i];
		bcc += tempdata[i];
	}
	if(lrc == ENC_KEY.key[138] && bcc == ENC_KEY.key[139] )
		return TRUE;
	else
		return FALSE;
	#else
	return TRUE;
	#endif
}

/**************************************************************************************
	*** 函 数 名:	uint8_t AsciiToHex(uint8_t * pAscii, uint8_t * pHex, int nLen)
	*** 功能描述：	将一个 ASSC 码表示的十六进制字符串转换成十六进制的字节串；
	*** 参    数:  	输入: pAscii -- 要转换的ASCII码表示的十六进制字符串的首地址；
						  nLen	 -- 要转换的ASCII码表示的十六进制字符串的长度（字节数）；
				    输出：pHex	 -- 转换后的十六进制数字节串首地址；
	*** 返 回 值:	TRUE/FALSE   	 	
	*** 模块信息: 	Ouyangweiquan 2011.09.20创建
***************************************************************************************/
uint8_t AsciiToHex(uint8_t *pAscii, uint8_t *pHex, int nLen)
{
	unsigned char Nibble[2];
	int nHexLen,i,j;
	if (nLen%2)
		return FALSE;
	nHexLen = nLen/2;
	for (i = 0; i < nHexLen; i ++)
	{
		
