zsurge/SecureHead/GD32APP0320/Src/app.c
		Nibble[0] = *pAscii++;
		Nibble[1] = *pAscii++;
		for (j = 0; j < 2; j++)
		{
			if (Nibble[j] <= 'F' && Nibble[j] >= 'A')
				Nibble[j] = Nibble[j] - 'A' + 10;
			else if (Nibble[j] <= 'f' && Nibble[j] >= 'a')
					Nibble[j] = Nibble[j] - 'a' + 10;
			else if (Nibble[j] >= '0' && Nibble[j] <= '9')
					Nibble [j] = Nibble[j] - '0';
			else
				return FALSE;
		}	// for (int j = ...)
		pHex[i] = Nibble[0] << 4;	// Set the high nibble
		pHex[i] |= Nibble[1];		//Set the low nibble
	}	// for (int i = ...)
	return TRUE;
}

/**************************************************************************************
	*** 函 数 名:	void HexToAscii(unsigned char * pHex, unsigned char * pASSCHex, int nLen)
	*** 功能描述：	将一个十六进制字节串转换成 ASCII 码表示的字符串；
	*** 参    数:  	输入: pHex 	   -- 要转换的十六进制数字节串首地址；
						  nLen	   -- 要转换的十六进制数字节串的长度（字节数）；
				    输出：pASSCHex -- 转换后的 ASCII 码表示的字符串的首地址；
	*** 返 回 值:	NULL   	 	
	*** 模块信息: 	Ouyangweiquan 2011.09.20创建
***************************************************************************************/
void HexToAscii(uint8_t *pHex, uint8_t *pASSCHex, int nLen)
{
	uint8_t Nibble[2];
	int i,j;
	for ( i = 0; i < nLen; i ++)
	{
		Nibble[0] = (pHex[i] & 0xF0) >> 4;	
		Nibble[1] = pHex[i] & 0x0F;
		for ( j = 0; j < 2; j ++)
		{
			if (Nibble[j] < 10)
				Nibble[j] += 0x30;
			else
			{
				if (Nibble[j] < 16)
					Nibble[j] = Nibble[j] - 10 + 'A';
			}
			*pASSCHex ++ = Nibble[j];
		}	// for (int j = ...)
	}	// for (int i = ...)
}

/**************************************************************************************
	*** 函 数 名:	void Random(void) 
	*** 功能描述：	取8个字节的16进制的随机数；
	*** 参    数:  	输入: NULL；
				    输出：8个十六进制随机数；
	*** 返 回 值:	NULL   	 	
	*** 模块信息: 	Ouyangweiquan 2011.09.20创建
***************************************************************************************/
void Random(void) 
{
	uint8_t i;
	for(i = 0; i < 8; i++)
	{
		random[i] = rand() % 255;
	}
}

/**************************************************************************************
	*** 函 数 名:	uint8_t GetNextKSN(uint8_t* pBUserKSN) 
	*** 功能描述：	使DUKPT算法因子KSN自加1；
	*** 参    数:  	输入: KSN；
				    输出：下一个KSN；
	*** 返 回 值:	FALSE / TRUE   	 	
	*** 模块信息: 	Ouyangweiquan 2011.11.18创建
***************************************************************************************/
uint8_t GetNextKSN(void)
{
	(*(ENC_KEY.temp.ksn + 9))++;
	if(	*(ENC_KEY.temp.ksn + 9) == 0x00)
	{
		(*(ENC_KEY.temp.ksn + 8))++;
		if(	*(ENC_KEY.temp.ksn + 8) == 0x00)
		{
			(*(ENC_KEY.temp.ksn + 7))++;
			if(	(*(ENC_KEY.temp.ksn + 7)) == 0x00)
			{
				(*(ENC_KEY.temp.ksn + 6))++;
				if(	*(ENC_KEY.temp.ksn + 6) == 0x00)
				{
					(*(ENC_KEY.temp.ksn + 5))++;
					if(	*(ENC_KEY.temp.ksn + 5) >= 0xFF)
					{
						return FALSE;
					}
				}
			}
		}
	}
	WriteFlag = 1;
	WriteENCKEY();							  //保存更新后的KSN
//	{
//		WriteFlag = 0;
//		return TRUE;
//	}
	WriteFlag = 0;
	return TRUE;
}


/**************************************************************************************
	*** 函 数 名:	void CalcCryptoKey(void) 
	*** 功能描述：	根据当前更新后的KSN和KEY计算出过程密钥；
	*** 参    数:  	输入: KSN和KEY；
				    输出：过程密钥；
	*** 返 回 值:	NULL   	 	
	*** 模块信息: 	Ouyangweiquan 2011.11.18创建
***************************************************************************************/
void CalcCryptoKey(void) 
{
	int counter;
	uint8_t k=1;
	//GetNextKSN();
	GetNextFlag = 1;
	IDT_LoadInitKey(1,ENC_KEY.temp.key,ENC_KEY.temp.ksn);
	counter = ENC_KEY.temp.ksn[9] | (ENC_KEY.temp.ksn[8] << 8) | ((ENC_KEY.temp.ksn[7] & 0x1f) << 16);
	do
	{	       
		IDT_EncryptPIN(1,IDT_ChangeCounter(counter, k),ENC_KEY.temp.ksn,CryptoKey,0); 
		k++;
	}while(k <= IDT_GetNumOfOnes(counter));
}

/**************************************************************************************
	*** 函 数 名:	void send_frame(uint8_t frame_type)
	*** 功能描述：	返回对命令的响应；
	*** 参    数:  	输入: frame_type -- 响应命令的参数；
	*** 返 回 值:	NULL   	 	
	*** 模块信息: 	Ouyangweiquan 2011.09.20创建
***************************************************************************************/
void send_frame(uint8_t frame_type)
{
    uint8_t i = 0, j, bcc;
	uint8_t TxdBuf[MAX_TXD_BUF_LEN];
	uint8_t TempBuf[20];
	uint8_t pBKCV[6];
	uint8_t bpSEncod[10]={0xFF,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00,0x00};
        
    switch (frame_type) 
	{
        case REQUEST_DOWN:   				/* request download */
            i = 0;						    //请求下载
			TxdBuf[i++] = frame_type;
			break;

		case READ_VERSION:					/* read application ersion */
			i = 0;
			TxdBuf[i++] = 0x06; 			// 06
			TxdBuf[i++] = RxdBuf[0]; 		// 02
			bcc = RxdBuf[0];
			TxdBuf[i++] = strlen(APPVERSION);
			bcc ^= strlen(APPVERSION);
			for(j = 0; j < strlen(APPVERSION); j++)
			{
				TxdBuf[i++] = APPVERSION[j];
            	bcc ^= APPVERSION[j];	
			}
			TxdBuf[i++] = ETX;
			bcc ^= ETX;
	        TxdBuf[i++] = bcc;
			break;
        			 
		case CMDSUCC:
		case CMDERRO:
			i = 0;						   //加密磁头协议
			TxdBuf[i++] = frame_type;
			break;
		case GETSECURITYLEVEL:					//0x7E	/* get security level */
			if(RxdBuf[2] == GETSECURITYLEVEL) 
			{
				i = 0;
				TxdBuf[i++] = 0x06; 			// 06
				TxdBuf[i++] = RxdBuf[0]; 		// 02
				bcc = RxdBuf[0];
				TxdBuf[i++] = GETSECURITYLEVEL;
	            bcc ^= GETSECURITYLEVEL;
				TxdBuf[i++] = 0x01;
	            bcc ^= 0x01;
				//ReadENCKEY();
				TxdBuf[i++] = ENC_KEY.temp.level;
	            bcc ^= ENC_KEY.temp.level; 				
				TxdBuf[i++] = ETX;
	            bcc ^= ETX;
	            TxdBuf[i++] = bcc;
				break;
			}
			init_serial_boot();	
			break;
		case GETCHALLENGE:
			if(RxdBuf[2] == GETCHALLENGE) 
			{
				i = 0;
				TxdBuf[i++] = 0x06; 			// 06
				TxdBuf[i++] = RxdBuf[0]; 		// 02
				bcc = RxdBuf[0];
				for(j=0; j<8; j++)  //拷贝随机数、计算异或和
				{
					TxdBuf[i++] = random[j];
					bcc ^= random[j];
				}
				TxdBuf[i++] = ETX;
	            bcc ^= ETX;
	            TxdBuf[i++] = bcc;
				break;
			}
			init_serial_boot();			
			break;			
		case READID:
			if(RxdBuf[2] == READID) 
			{
				i = 0;
				//TxdBuf[i++] = 0xFF; 			// FF
				TxdBuf[i++] = 0x06; 			// 06
				TxdBuf[i++] = RxdBuf[0]; 		// 02
				bcc = RxdBuf[0];
				for(j=0; j<strlen(SHID); j++)  //拷贝安全磁头ID、计算异或和
				{
					TxdBuf[i++] = SHID[j];
					bcc ^= SHID[j];
				}
				TxdBuf[i++] = ETX;
	            bcc ^= ETX;
	            TxdBuf[i++] = bcc;
				break;
			}
			init_serial_boot();
			break;
		case REVIEWKSN:
			if(RxdBuf[2] == REVIEWKSN) 
			{
				i = 0;
				TxdBuf[i++] = 0x06; 			// 06
				TxdBuf[i++] = RxdBuf[0]; 		// 02
				bcc = RxdBuf[0];
				TxdBuf[i++] = RxdBuf[2];		// 51
				bcc ^= RxdBuf[2];
				TxdBuf[i++] = 0x0B;				// 0B
				bcc ^= 0x0B;
				TxdBuf[i++] = 0x0A;				// 0A
				bcc ^= 0x0A;
				
