zsurge/SecureHead/GD32APP0320/Src/app.c
				for(j=0; j< 10; j++)  			//拷贝KSN、计算异或和
				{
					TxdBuf[i++] = ENC_KEY.temp.ksn[j];
					bcc ^= ENC_KEY.temp.ksn[j];
				}
				TxdBuf[i++] = ETX;
	            bcc ^= ETX;
	            TxdBuf[i++] = bcc;
				break;
			}
			init_serial_boot();
			break;
		case REVIEWSN:							//0x4E	/* review serial number */
			if(RxdBuf[2] == REVIEWSN) 
			{
				i = 0;
				TxdBuf[i++] = 0x06; 			// 06
				TxdBuf[i++] = RxdBuf[0]; 		// 02
				bcc = RxdBuf[0];
				TxdBuf[i++] = RxdBuf[2];		// 4E
				bcc ^= RxdBuf[2];
				TxdBuf[i++] = 0x0B;				// 0B
				bcc ^= 0x0B;
				TxdBuf[i++] = 0x0A;				// 0A
				bcc ^= 0x0A;
				
				for(j=0; j<0x0A; j++)  			//拷贝SN、计算异或和
				{
					TxdBuf[i++] = ENC_KEY.temp.sn[j];
					bcc ^= ENC_KEY.temp.sn[j];
				}
				TxdBuf[i++] = ETX;
	            bcc ^= ETX;
	            TxdBuf[i++] = bcc;
				break;
			}
			init_serial_boot();
			break;
		case SETSID:							//0x54	/* set Session ID */
			if(RxdBuf[2] == SETSID) 
			{
				i = 0;
				TxdBuf[i++] = 0x06; 			// 06
				TxdBuf[i++] = RxdBuf[0]; 		// 02
				bcc = RxdBuf[0];
				TxdBuf[i++] = RxdBuf[2];		// 54
				bcc ^= RxdBuf[2];
				TxdBuf[i++] = 0x09;				// 09
				bcc ^= 0x09;
				TxdBuf[i++] = 0x08;				// 08
				bcc ^= 0x08;
				
				for(j=0; j< 8; j++)  			//拷贝SID、计算异或和
				{
					TxdBuf[i++] = ENC_KEY.temp.sid[j];
					bcc ^= ENC_KEY.temp.sid[j];
				}
				TxdBuf[i++] = ETX;
	            bcc ^= ETX;
	            TxdBuf[i++] = bcc;
				break;
			}
			init_serial_boot();
			break;
		case SETKEYCOMMU:
			{
				i = 0;
				if(0 == SetKeyFlag)
				{
					memcpy(TxdBuf,"\x06\x02\x46\x46\x00\x00\x00\x00\x00\x00\x00\x00\x0D\x0A\x03\x00",16);
					to64frombits(TempBuf,"\xFF\x00\x01\x04\xFA",5);
					memcpy(&TxdBuf[4],TempBuf,8);
					for(bcc = 0, i = 2; i < 15; i++)
						bcc ^= TxdBuf[i];
					TxdBuf[i++] = bcc;
				}
			}
			break;
		case SETKEYVALUE:
			{
				i = 0;
				if(1 == SetKeyFlag)
				{
					memcpy(TxdBuf,"\x06\x02\x46\x46\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x0D\x0A\x03\x00",23);
					GetKeyCkeckValue(ENC_KEY.temp.ksn,pBKCV,8,ET_DES_MS);
					HexToAscii(pBKCV, bpSEncod+3, 3);
					for(bcc = 0, i = 0; i < 9; i++)
						bcc ^= bpSEncod[i];
					bpSEncod[i] = bcc;
					to64frombits(TempBuf,bpSEncod,10);
					memcpy(&TxdBuf[4],TempBuf,15);					
					for(bcc = 0, i = 2; i < 22; i++)
						bcc ^= TxdBuf[i];
					TxdBuf[i++] = bcc;
				}
				else if(2 == SetKeyFlag)
				{
					memcpy(TxdBuf,"\x06\x02\x46\x46\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x0D\x0A\x03\x00",23);
					GetKeyCkeckValue(ENC_KEY.temp.key,pBKCV,16,ET_DES_MS);
					HexToAscii(pBKCV, bpSEncod+3, 3);
					for(bcc = 0, i = 0; i < 9; i++)
						bcc ^= bpSEncod[i];
					bpSEncod[i] = bcc;
					to64frombits(TempBuf,bpSEncod,10);
					memcpy(&TxdBuf[4],TempBuf,15);
					for(bcc = 0, i = 2; i < 22; i++)
						bcc ^= TxdBuf[i];
					TxdBuf[i++] = bcc;
				}
			}
			break;
        default:
        	init_serial_boot();
			return;
    }
	//dev_com_write(TxdBuf, i);
	UsbSendBuff(TxdBuf, i, 3000);

	//发送命令的响应
//	printf("Send:");
//	for (bcc = 0; bcc < i; bcc++)
//		printf("%02X ", TxdBuf[bcc]);
//	printf("\r\n");
}


/**************************************************************************************
	*** 函 数 名:	void DealSerialParse(void)
	*** 功能描述：	将收到的数据解析成数据包；
	*** 参    数:  	NULL
	*** 返 回 值:	NULL   	 	
	*** 模块信息: 	Ouyangweiquan 2011.09.20创建
***************************************************************************************/
void DealSerialParse(void)
{
	uint8_t i = 0;
	while(1)
	{	
		if(UsbRecvOne(&i) != 1)  //读取USB数据
		{
		    return;
		}	
		
		switch (RxdStatus)
		{ /*接收数据状态*/
			case 0:
				if(STX == i)
				{
					RxdBuf[0] = i;
					Bcc = i;
					NowLen = 1;
					RxdStatus = 25;
				}
				else 
				{
					SynHead = 0;
				}
				break;				/*接收包头*/
			case 25:
				if (i == ETX) 
				{
					RxdStatus = 26;
				}
				RxdBuf[NowLen++] = i;
				Bcc ^= i;
				break;
			case 26:
				if(i == Bcc || (i ^ 0x02) == Bcc)
				{
					RxdBuf[NowLen++] = i;
					RxdTotalLen = NowLen;
					RxdFrameStatus = FINISH;					
					RxdStatus = 0;
					SynHead = 0;
					break;
				}
				else
				{
					RxdBuf[NowLen++] = i;
					Bcc ^= i;
					RxdStatus = 25;
				}
				break;
			default:
				if (RxdFrameStatus == SPACE) 
				{
					RxdStatus = 0;
					SynHead = 0;
				}
			break;
		 }
	}
}

/**************************************************************************************
	*** 函 数 名:	void DealRxData(void)
	*** 功能描述：	解析收到的完整数据包，并响应数据包；
	*** 参    数:  	NULL
	*** 返 回 值:	NULL   	 	
	*** 模块信息: 	Ouyangweiquan 2011.09.20创建
***************************************************************************************/
void DealRxData(void)
{
	uint16_t i;
	uint8_t bcc = 0;
    
	if (FINISH == RxdFrameStatus)
	{
		//spi_send(RxdBuf,RxdTotalLen);
		//打印一条接收到的命令
//		printf("CMD:");
//		for (i = 0; i < RxdTotalLen; i++)
//			printf("%02X ", RxdBuf[i]);
//		printf("\r\n");

    DBG_H("CMD", RxdBuf, RxdTotalLen);
		
		wwdgt_counter_update(0);
		if(RxdBuf[0] == STX)										//解析02数据包
		{
			if (REQUEST_DOWN == RxdBuf[1])							//0x55	/* request download */
			{
				send_frame(CMDSUCC);
																	//重启
				init_serial_boot();
				
				WriteUpgradeFlag();
				NVIC_SystemReset();
				delay_1ms(10000); 		
			    while(1);
			    
			}
			else if (READ_VERSION == RxdBuf[1])						//0x28	/* read application ersion */
			{
				send_frame(READ_VERSION);
				init_serial_boot();
			}
			else if (RESETHEAD == RxdBuf[1])						//0xF8	/* reset secureheadreader */
			{
//				SetKeyFlag = 0;
//				memset(ENC_KEY.key,0x00,136);
//				ENC_KEY.temp.level = 0x31;
//				ENC_KEY.temp.enabledevice = 0x31;
//				ENC_KEY.temp.writesnflag = 0x30;
//				ENC_KEY.temp.selecttrack = 0x30;
//				ENC_KEY.temp.Terminator = 0x0D;
//				WriteFlag = 1;
//				WriteENCKEY();
//				send_frame(CMDSUCC);
//				WriteFlag = 0;

//            	SetKeyFlag = 0;
//            	memset(ENC_KEY.key,0x00,136);
//            	ENC_KEY.temp.level = 0x31;
//            	ENC_KEY.temp.enabledevice = 0x31;
//            	ENC_KEY.temp.writesnflag = 0x30;
//            	ENC_KEY.temp.selecttrack = 0x30;
//            	ENC_KEY.temp.Terminator = 0x0D;            	
//            	ENC_KEY.temp.status = 0;			//失能加密
//            	ENC_KEY.temp.encway = 0x00;			//默认DES加密   
//            	
//            	WriteFlag = 1;
//            	WriteENCKEY();	
//            	send_frame(CMDSUCC);
//            	WriteFlag = 0;	
                ResetSetting();
                send_frame(CMDSUCC);
				init_serial_boot();
			}
			else if (SETKEY == RxdBuf[1] && SETKEY == RxdBuf[2])	//0x46	/* set key commands  */
			{
				memset(SetKeyBuf,0,sizeof(SetKeyBuf));
				SetKeyLen = from64tobits(SetKeyBuf,&RxdBuf[3],RxdTotalLen-7);
				if(SetKeyBuf[0] == SETKEYHEAD)
				{
					bcc = 0;	
					for(i = 0; i < SetKeyLen-1; i++)
						bcc ^= SetKeyBuf[i];
					if (bcc == SetKeyBuf[SetKeyLen -1])			   	//校验
					{
						SetKeyLen =  SetKeyBuf[2];					//拷贝密钥数据长度
						switch (SetKeyBuf[1])
						{
							case SETKEYCOMMU:						//0x13	/* setting key communications commands */
								if(0x01 == SetKeyLen && 0x02 == SetKeyBuf[3])
								{
									send_frame(SETKEYCOMMU);
									SetKeyFlag = 1;
								}
								else
								{
									send_frame(CMDERRO);
									SetKeyFlag = 0;
								}
								init_serial_boot();
								break;
							case SETKEYVALUE:						//0x0A	/* setting key value commands */
								if(SetKeyFlag > 0)
								{
									if(0x11 == SetKeyLen && 0x32==SetKeyBuf[3])			/* setting ksn value commands */
									{
										AsciiToHex(&SetKeyBuf[4],ENC_KEY.temp.ksn,SetKeyLen-1);
										if(GetNextKSN())
										{
											send_frame(SETKEYVALUE);
											SetKeyFlag = 2;
										}	
										else
											send_frame(CMDERRO);
										//WriteFlag = 0;
									}
									else if(0x21 == SetKeyLen && 0x33==SetKeyBuf[3])	   /* setting key value commands */
									{
										AsciiToHex(&SetKeyBuf[4],ENC_KEY.temp.key,SetKeyLen-1);
										ENC_KEY.temp.encmode = 0x31;
										ENC_KEY.temp.level = 0x33; 
										WriteFlag = 1;
										WriteENCKEY();
										send_frame(SETKEYVALUE);
										SetKeyFlag = 0;
//											}	
//											else
//												send_frame(CMDERRO);
										WriteFlag = 0;
									}										
								}
								else
									send_frame(CMDERRO);
								init_serial_boot();
								break;
							default:
    	           				init_serial_boot();
        	    				break; 
						}
					}
				}
				
