zsurge/SecureHead/GD32APP0320/Src/app.c
			}				
			else if (READCMD == RxdBuf[1])					//0x52	/* read status commands */
			{
				switch (RxdBuf[2])
				{
					case READID:						    //0x22	/* read secureheadreader ID */
						send_frame(READID);
						RxdFrameStatus = SPACE;
                		break;
					case GETCHALLENGE:						//0x74	/* get encrypt challenge */
						Random();							//产生随机数
						send_frame(GETCHALLENGE);
						RxdFrameStatus = SPACE;
                		break;
					case GETSECURITYLEVEL:					//0x7E	/* get security level */
						send_frame(GETSECURITYLEVEL);
						RxdFrameStatus = SPACE;
                		break;
					case REVIEWKSN:							//0x51	/* review KSN (DUKPT key management only) */
						send_frame(REVIEWKSN);
						RxdFrameStatus = SPACE;
                		break;
					case REVIEWSN:							//0x4E	/* review serial number */
						send_frame(REVIEWSN);
						RxdFrameStatus = SPACE;
                		break;
					case SETSID:							//0x54	/* set Session ID */
						send_frame(SETSID);
						RxdFrameStatus = SPACE;
                		break;					
	           		default:
    	           		init_serial_boot();
        	    		break;
        		}
			}
			else if (SETTINGCMD == RxdBuf[1])				//0x53	/* setting commands */
			{
				switch (RxdBuf[2])
				{
					case SETDEFAULT:						//0x18	/* set default configuration */
						ENC_KEY.temp.status = 0;			//失能加密
						ENC_KEY.temp.level = 0x31;			//加密级别为1
						ENC_KEY.temp.encway = 0x00;			//默认DES加密
						macstate = 0x00;					//未接收到鉴定数据
						WriteFlag = 1;
						WriteENCKEY();						//保存更新后的KEY
						WriteFlag = 0;	                        
						send_frame(CMDSUCC);
						RxdFrameStatus = SPACE;
                		break;
                	case SETBEEP:
                		if(RxdBuf[3] == 0x01)
						{	
							if(0x30 <= RxdBuf[4] && 0x34 > RxdBuf[4])		 //匹配命令的参数
							{
								ENC_KEY.temp.beepmode = RxdBuf[4];	//读取设置的加密方式							
								WriteFlag = 1;
								WriteENCKEY();				//保存更新后的KEY
								WriteFlag = 0;
								
								send_frame(CMDSUCC);
							}
							else
							{
								send_frame(CMDERRO);
							}
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;
                		break;
                	case SETSELECTTRACK :
                	    if(RxdBuf[3] == 0x01)
						{	
							if(0x30 <= RxdBuf[4] && 0x39 >= RxdBuf[4])		 //匹配命令的参数
							{
								ENC_KEY.temp.selecttrack = RxdBuf[4];	//读取设置的加密方式							
								WriteFlag = 1;
								WriteENCKEY();				//保存更新后的参数
								WriteFlag = 0;
								
								send_frame(CMDSUCC);
							}
							else
							{
								send_frame(CMDERRO);
							}
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;
                	    break;
            	    case SETTRACKSEPARATOR:
                	    if(RxdBuf[3] == 0x01)
						{	
							if(0 <= RxdBuf[4] && 127 >= RxdBuf[4])		 //匹配命令的参数
							{
								ENC_KEY.temp.setseparator = RxdBuf[4];	//写入分割符							
								WriteFlag = 1;
								WriteENCKEY();				//保存更新后的参数
								WriteFlag = 0;
								
								send_frame(CMDSUCC);
							}
							else
							{
								send_frame(CMDERRO);
							}
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;            	    
            	    break;
            	    case SETTRACK2:
                	    if(RxdBuf[3] == 0x01)
						{	
							if(0x30 <= RxdBuf[4] && 0x34 > RxdBuf[4])		 //匹配命令的参数
							{
								ENC_KEY.temp.settrack2format = RxdBuf[4];	//读取设置的加密方式							
								WriteFlag = 1;
								WriteENCKEY();				//保存更新后的参数
								WriteFlag = 0;								
								send_frame(CMDSUCC);
							}
							else
							{
								send_frame(CMDERRO);
							}
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;            	    
            	        break;
					case SETDECODEWAY:						//0x1D	/* set decoding in both directions */	
					    //这里还未完成，待补充
						send_frame(CMDSUCC);
						RxdFrameStatus = SPACE;
                		break;
					case SETENCMODE:						//0x58	/* set encryption mode */							
						if(RxdBuf[3]==0x01)
						{	
							if(0x30==RxdBuf[4]|| 0x31==RxdBuf[4])
							{
								ENC_KEY.temp.encmode = RxdBuf[4];	//读取设置的加密方式
								if(0x30 == RxdBuf[4])
									ENC_KEY.temp.level = 0x32;
								else
									ENC_KEY.temp.level = 0x33;	
								WriteFlag = 1;
								WriteENCKEY();				//保存更新后的KEY
								WriteFlag = 0;
								send_frame(CMDSUCC);
							}
							else
								send_frame(CMDERRO);
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;
                		break;
					case SENDAUTHDATA:						//0x74	/* send authentication data */
						tri_des(random,ENC_KEY.temp.fix,ENC_KEY.temp.fix+8,0);
						if(memcmp(random,&RxdBuf[4],RxdBuf[3]) == 0)
						{
							macstate = 0x31;				//鉴定数据OK
							memset(random,0x00,8);			//清空随机数
							send_frame(CMDSUCC);	
						}
						else
						{
							macstate = 0x30;				//鉴定数据失败
							memset(random,0x00,8);			//清空随机数
							send_frame(CMDERRO);	
						}
						RxdFrameStatus = SPACE;
                		break;
					case SETENCWAY:							//0x4C	/* set encryption way */
                        
						if(RxdBuf[3]==0x01)
						{	
							if(0x30 == RxdBuf[4] || 0x31 == RxdBuf[4] || 0x32 == RxdBuf[4])
							{
								ENC_KEY.temp.encway = RxdBuf[4];//读取设置的加密类型
								ENC_KEY.temp.status = 1;	//使能加密
								WriteFlag = 1;
								WriteENCKEY();				//保存更新后的KEY
								WriteFlag = 0;
								send_frame(CMDSUCC);
							}
							else
								send_frame(CMDERRO);
						}
						else
						{
							ENC_KEY.temp.status = 0;		//失能加密
							WriteFlag = 1;
							WriteENCKEY();					//保存更新后的KEY
							WriteFlag = 0;
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;
                		break;
					case SETENCRYPTIONOPTION:					//0x84	/* Encryption Option Setting*/
						if(RxdBuf[3]==0x01)
						{	
							if(0x08 == RxdBuf[4])		    //默认设置为08，还需要再修改
							{
								send_frame(CMDSUCC);
							}
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;
                		break;
					case SETENCRYPTIONFORMAT:					 //0x85	/* Encryption Output Format Setting */
						if(RxdBuf[3] == 0x01)
						{	
							if(0x31 == RxdBuf[4])		 //匹配命令的参数
							{
								send_frame(CMDSUCC);
							}
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;
                		break;
					case SETDEVICEKEY:						//0x76	/* set device key command */
						if(RxdBuf[3]==0x10 && 0x31 == macstate)
						{
							memcpy(ENC_KEY.temp.fix,&RxdBuf[4],RxdBuf[3]);
							ENC_KEY.temp.level = 0x32;
							WriteFlag = 1;
							WriteENCKEY();					//保存更新后的KEY
							WriteFlag = 0; 								
							send_frame(CMDSUCC);
						}
						else
							send_frame(CMDERRO);	
						RxdFrameStatus = SPACE;
                		break;
					case SETSID:							//0x54	/* set Session ID */
						if(RxdBuf[3]==0x08)
						{
							memcpy(ENC_KEY.temp.sid,&RxdBuf[4],8);
							WriteFlag = 1;
							WriteENCKEY();					//保存会话ID
							WriteFlag = 0; 								
							send_frame(CMDSUCC);
						}
						else
							send_frame(CMDERRO);	
						RxdFrameStatus = SPACE;
                		break;
					case REVIEWSN:							//0x4E	/* review serial number */
						if(RxdBuf[3]==0x0A)
						{
						    if(ENC_KEY.temp.writesnflag == 0x30)
						    {
    							memcpy(ENC_KEY.temp.sn,&RxdBuf[4],10);
    							ENC_KEY.temp.writesnflag = 0x31;
    							WriteFlag = 1;
    							WriteENCKEY();					//保存序列号
    							WriteFlag = 0; 								
    							send_frame(CMDSUCC);
							}
							else
							{
							    send_frame(CMDERRO);  //只能写一次
							}
						}
						else
							send_frame(CMDERRO);	
						RxdFrameStatus = SPACE;
                		break;
					case MSRSETTINGS:						//0x1A	/* MSR Reading Settings */							
						if(RxdBuf[3]==0x01)
						{
						    if(RxdBuf[4] == 0x30) //add 20180205 level=0 dissable dev
							{							    
								ENC_KEY.temp.enabledevice = 0x30;
    							WriteFlag = 1;
    							WriteENCKEY();					
    							WriteFlag = 0; 		
    							send_frame(CMDSUCC);    							
							}
							else
							{
    							ENC_KEY.temp.enabledevice = RxdBuf[4];
    							WriteFlag = 1;
    							WriteENCKEY();					
    							WriteFlag = 0; 		
    							send_frame(CMDSUCC);
							}
						}	
						else
							send_frame(CMDERRO);	
						RxdFrameStatus = SPACE;
		            break;
                    case SETTERMINATOR:
                        if(RxdBuf[3]==0x01)
						{	
							ENC_KEY.temp.Terminator = RxdBuf[4];
							WriteFlag = 1;
							WriteENCKEY();					
							WriteFlag = 0; 		
							send_frame(CMDSUCC);   
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;
                        break;
                    case SETPREAMBLE:
                        if(RxdBuf[3] <= 0x0F && RxdBuf[3] >= 0)
						{								
							memset(ENC_KEY.temp.Preamble,0x00,sizeof(ENC_KEY.temp.Preamble));
							memcpy(ENC_KEY.temp.Preamble,&RxdBuf[5],RxdBuf[3]);
							WriteFlag = 1;
							WriteENCKEY();					
							WriteFlag = 0; 		
							send_frame(CMDSUCC);   
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;
					    break;					
                    case SETPOSTAMBLE:
                        if(RxdBuf[3] <= 0x0F && RxdBuf[3] >= 0)
						{								
							memset(ENC_KEY.temp.Postamble,0x00,sizeof(ENC_KEY.temp.Postamble));
							memcpy(ENC_KEY.temp.Postamble,&RxdBuf[5],RxdBuf[3]);
							WriteFlag = 1;
							WriteENCKEY();					
							WriteFlag = 0; 		
							send_frame(CMDSUCC);   
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;                    
						break;
                    case SETTRACK1PREFIX:
                        if(RxdBuf[3] <= 0x06 && RxdBuf[3] >= 0)
						{	
							memset(ENC_KEY.temp.track1prefix,0x00,sizeof(ENC_KEY.temp.track1prefix));
							memcpy(ENC_KEY.temp.track1prefix,&RxdBuf[5],RxdBuf[3]);
							WriteFlag = 1;
							WriteENCKEY();					
							WriteFlag = 0; 		
							send_frame(CMDSUCC);   
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;                     
						break;
                    case SETTRACK2PREFIX:
                        if(RxdBuf[3] <= 0x06 && RxdBuf[3] >= 0)
						{	
							memset(ENC_KEY.temp.track2prefix,0x00,sizeof(ENC_KEY.temp.track2prefix));
							memcpy(ENC_KEY.temp.track2prefix,&RxdBuf[5],RxdBuf[3]);
							WriteFlag = 1;
							WriteENCKEY();					
							WriteFlag = 0; 		
							send_frame(CMDSUCC);   
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;  
						break;
                    case SETTRACK3PREFIX:
                        if(RxdBuf[3] <= 0x06 && RxdBuf[3] >= 0)
						{	
							memset(ENC_KEY.temp.track3prefix,0x00,sizeof(ENC_KEY.temp.track3prefix));
							memcpy(ENC_KEY.temp.track3prefix,&RxdBuf[5],RxdBuf[3]);
							WriteFlag = 1;
							WriteENCKEY();					
							WriteFlag = 0; 		
							send_frame(CMDSUCC);   
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;  
						break;
                    case SETTRACK1SUFFIX:
                        if(RxdBuf[3] <= 0x06 && RxdBuf[3] >= 0)
						{	
							memset(ENC_KEY.temp.track1suffix,0x00,sizeof(ENC_KEY.temp.track1suffix));
							memcpy(ENC_KEY.temp.track1suffix,&RxdBuf[5],RxdBuf[3]);
							WriteFlag = 1;
							WriteENCKEY();					
							WriteFlag = 0; 		
							send_frame(CMDSUCC);   
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;                      
						break;
                    case SETTRACK2SUFFIX:
                        if(RxdBuf[3] <= 0x06 && RxdBuf[3] >= 0)
						{	
							memset(ENC_KEY.temp.track2suffix,0x00,sizeof(ENC_KEY.temp.track2suffix));
							memcpy(ENC_KEY.temp.track2suffix,&RxdBuf[5],RxdBuf[3]);
							WriteFlag = 1;
							WriteENCKEY();					
							WriteFlag = 0; 		
							send_frame(CMDSUCC);   
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;  
						break;
                    case SETTRACK3SUFFIX:
                        if(RxdBuf[3] <= 0x06 && RxdBuf[3] >= 0)
						{								
					        memset(ENC_KEY.temp.track3suffix,0x00,sizeof(ENC_KEY.temp.track3suffix));
							memcpy(ENC_KEY.temp.track3suffix,&RxdBuf[5],RxdBuf[3]);
							WriteFlag = 1;
							WriteENCKEY();					
							WriteFlag = 0; 		
							send_frame(CMDSUCC);   
						}
						else
						{
							send_frame(CMDERRO);
						}
						RxdFrameStatus = SPACE;  
						break;

		            
	    	        default:
	        	       init_serial_boot();
	            	break;
	            }
			}
			else
			{
				init_serial_boot();
			}
		}
		else
		{
			init_serial_boot();
		}
	}
}


